#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.nat_gateway.random_uuid.telemetry[0]: Refreshing state... [id=0644300d-69a3-aba0-1eb1-adb37059d6ed]
module.resource_group.random_uuid.telemetry[0]: Refreshing state... [id=5f925706-b3ea-01b3-043e-ddef68416e79]
module.private_dns_zone_storage_account.random_uuid.telemetry[0]: Refreshing state... [id=da6cca3e-536c-a74c-80f8-68e0eac76400]
module.regions.random_uuid.telemetry[0]: Refreshing state... [id=122024c0-32c4-02d6-29b1-e45451db33de]
module.virtual_network.random_uuid.telemetry[0]: Refreshing state... [id=b88203d8-503e-b8f6-d104-eadbca32da8f]
module.avm-utl-network-ip-addresses.random_uuid.telemetry[0]: Refreshing state... [id=707feac5-fe0d-6d42-ce28-76b8e171335f]
module.log_analytics_workspace.random_uuid.telemetry[0]: Refreshing state... [id=ef08e9c1-7da7-4eb4-e8c8-3a500cd1148c]
module.storage_account.random_uuid.telemetry[0]: Refreshing state... [id=00797736-9319-5583-9c57-33ffc13554b3]
module.network_security_group.random_uuid.telemetry[0]: Refreshing state... [id=b1c235b7-2799-63f0-8a3a-8ef4829406f4]
module.user_assigned_managed_identity.random_uuid.telemetry[0]: Refreshing state... [id=6a346a94-586a-8b85-9734-ffc92eac4db0]
data.http.ip: Reading...
module.key_vault.random_uuid.telemetry[0]: Refreshing state... [id=677e83a5-7bcf-adc3-235f-e4fbc28cd123]
module.private_dns_zone_key_vault.random_uuid.telemetry[0]: Refreshing state... [id=f65e37d3-fb9c-9c75-f1d1-30b2d084ad65]
module.private_dns_zone_key_vault.data.modtm_module_source.telemetry[0]: Reading...
module.network_security_group.data.modtm_module_source.telemetry[0]: Reading...
module.user_assigned_managed_identity.data.modtm_module_source.telemetry[0]: Reading...
module.private_dns_zone_key_vault.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.user_assigned_managed_identity.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.network_security_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.virtual_network.data.modtm_module_source.telemetry[0]: Reading...
module.regions.data.modtm_module_source.telemetry[0]: Reading...
module.key_vault.data.modtm_module_source.telemetry[0]: Reading...
module.key_vault.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.nat_gateway.data.modtm_module_source.telemetry[0]: Reading...
module.virtual_network.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.regions.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Reading...
module.storage_account.data.modtm_module_source.telemetry[0]: Reading...
module.nat_gateway.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.avm-utl-network-ip-addresses.data.modtm_module_source.telemetry[0]: Reading...
module.storage_account.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group.data.modtm_module_source.telemetry[0]: Reading...
module.private_dns_zone_storage_account.data.modtm_module_source.telemetry[0]: Reading...
module.resource_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.private_dns_zone_storage_account.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.avm-utl-network-ip-addresses.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.avm-utl-network-ip-addresses.data.azapi_client_config.telemetry[0]: Reading...
module.regions.data.azapi_client_config.telemetry[0]: Reading...
module.regions.data.azapi_client_config.current: Reading...
data.http.ip: Read complete after 0s [id=https://api.ipify.org/]
module.avm-utl-network-ip-addresses.data.azapi_client_config.telemetry[0]: Read complete after 1s [id=clientConfigs/subscriptionId=1ab5dc89-603c-4f45-bdd1-a4231369b400;tenantId=da1aa744-f43d-46fd-8308-5a3f6b99452a]
module.regions.data.azapi_client_config.current: Read complete after 1s [id=clientConfigs/subscriptionId=1ab5dc89-603c-4f45-bdd1-a4231369b400;tenantId=da1aa744-f43d-46fd-8308-5a3f6b99452a]
module.regions.data.azapi_client_config.telemetry[0]: Read complete after 1s [id=clientConfigs/subscriptionId=1ab5dc89-603c-4f45-bdd1-a4231369b400;tenantId=da1aa744-f43d-46fd-8308-5a3f6b99452a]
module.avm-utl-network-ip-addresses.modtm_telemetry.telemetry[0]: Refreshing state... [id=4185296b-b5a2-4869-8322-e759629b9741]
module.regions.modtm_telemetry.telemetry[0]: Refreshing state... [id=06896a01-d1c5-464f-87f2-78df8eea5cbb]
data.azurerm_client_config.current: Reading...
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev]
module.resource_group.data.azurerm_client_config.telemetry[0]: Reading...
module.private_dns_zone_storage_account.data.azurerm_client_config.telemetry[0]: Reading...
module.virtual_network.data.azurerm_client_config.telemetry[0]: Reading...
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Reading...
module.nat_gateway.data.azurerm_client_config.telemetry[0]: Reading...
module.user_assigned_managed_identity.data.azurerm_client_config.telemetry[0]: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.nat_gateway.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.storage_account.data.azurerm_client_config.telemetry[0]: Reading...
module.private_dns_zone_storage_account.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.data.azurerm_client_config.this: Reading...
module.virtual_network.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.user_assigned_managed_identity.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.resource_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.private_dns_zone_key_vault.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.data.azurerm_subscription.current: Reading...
module.network_security_group.data.azurerm_client_config.telemetry[0]: Reading...
module.virtual_network.data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.nat_gateway.modtm_telemetry.telemetry[0]: Refreshing state... [id=2549ffb0-0752-4e59-baad-f3f629df1694]
module.storage_account.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.private_dns_zone_storage_account.modtm_telemetry.telemetry[0]: Refreshing state... [id=28b91b2c-f9f1-4745-b784-59554456c7a6]
module.key_vault.data.azurerm_client_config.telemetry[0]: Reading...
module.virtual_network.modtm_telemetry.telemetry[0]: Refreshing state... [id=ffc202ee-1053-4189-ba3f-5f03f3d4f102]
module.user_assigned_managed_identity.modtm_telemetry.telemetry[0]: Refreshing state... [id=3c0740bb-18c6-4cc2-8d61-04cbf079962f]
module.network_security_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.log_analytics_workspace.modtm_telemetry.telemetry[0]: Refreshing state... [id=b25ee70c-5547-47fa-a161-6d8168712422]
module.key_vault.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.private_dns_zone_key_vault.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.network_security_group.modtm_telemetry.telemetry[0]: Refreshing state... [id=270e3746-fe75-40cd-8ce4-39f7fc5e519f]
module.resource_group.modtm_telemetry.telemetry[0]: Refreshing state... [id=32fc6941-d4e5-4634-a7dd-ad106877e3af]
module.storage_account.modtm_telemetry.telemetry[0]: Refreshing state... [id=efa8ee7b-07a2-4984-9117-7d26574c1635]
module.key_vault.modtm_telemetry.telemetry[0]: Refreshing state... [id=d8fb783d-0718-46bf-9e01-38a6d0e09fd1]
module.private_dns_zone_key_vault.modtm_telemetry.telemetry[0]: Refreshing state... [id=3200c1d1-64b0-4470-afc4-43c83b577c82]
module.resource_group.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400]
module.nat_gateway.azurerm_public_ip.this["default"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip-nat-crv-githublab-demo-dev]
module.private_dns_zone_storage_account.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net]
module.log_analytics_workspace.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev]
module.nat_gateway.azurerm_nat_gateway.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/natGateways/nat-crv-githublab-demo-dev]
module.network_security_group.azurerm_network_security_group.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev]
module.key_vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/keyvcrv-githublabdemodev]
module.user_assigned_managed_identity.azurerm_user_assigned_identity.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-crv-githublab-demo-dev]
module.private_dns_zone_key_vault.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.virtual_network.azapi_resource.vnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev]
module.storage_account.azurerm_storage_account.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev]
module.nat_gateway.azurerm_nat_gateway_public_ip_association.this["default"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/natGateways/nat-crv-githublab-demo-dev|/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip-nat-crv-githublab-demo-dev]
module.network_security_group.azurerm_network_security_rule.this["no_internet"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev/securityRules/block-internet-traffic]
module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet]
module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines]
module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints]
module.network_security_group.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev|sendToLogAnalytics]
module.virtual_network.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev|sendToLogAnalytics]
module.private_dns_zone_storage_account.azurerm_private_dns_zone_virtual_network_link.this["vnetlink1"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/storage-account]
module.private_dns_zone_key_vault.azurerm_private_dns_zone_virtual_network_link.this["vnetlink1"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/key-vault]
module.storage_account.azurerm_monitor_diagnostic_setting.blob["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev/blobServices/default/|sendToLogAnalytics]
module.storage_account.azurerm_monitor_diagnostic_setting.storage_account["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev|sendToLogAnalytics]
module.storage_account.azurerm_private_endpoint.this["primary"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateEndpoints/pe-sacrvgithublabdemodev]
module.key_vault.azurerm_private_endpoint.this["primary"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateEndpoints/pe-keyvcrv-githublabdemodev]
module.key_vault.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/keyvcrv-githublabdemodev|sendToLogAnalytics]
module.virtual_machine.random_uuid.telemetry[0]: Refreshing state... [id=506557a6-22fd-73b5-dee4-78445b797de2]
module.virtual_machine.azurerm_network_interface.virtualmachine_network_interfaces["private"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkInterfaces/nic-crv-githublab-demo-dev]
module.virtual_machine.tls_private_key.this[0]: Refreshing state... [id=fbe40774be3a73645abaa757141277793d1e0dfc]
module.virtual_machine.modtm_telemetry.telemetry[0]: Refreshing state... [id=4c025758-d4ad-42a0-8505-207388776fcf]
module.virtual_machine.azurerm_linux_virtual_machine.this[0]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Compute/virtualMachines/vm-crv-githublab-demo-dev]
module.virtual_machine.azurerm_monitor_diagnostic_setting.this_vm_diags["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Compute/virtualMachines/vm-crv-githublab-demo-dev|sendToLogAnalytics]
module.storage_account.azapi_resource.containers["demo"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev/blobServices/default/containers/demo]
module.storage_account.azurerm_role_assignment.containers["demo-contributor"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev/blobServices/default/containers/demo/providers/Microsoft.Authorization/roleAssignments/3dd20f65-446a-dade-b7f1-18483aa2cb13]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.virtual_machine.azurerm_linux_virtual_machine.this[0] has changed
  ~ resource "azurerm_linux_virtual_machine" "this" {
        id                                                     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Compute/virtualMachines/vm-crv-githublab-demo-dev"
        name                                                   = "vm-crv-githublab-demo-dev"
        tags                                                   = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (39 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.virtual_network.azapi_resource.vnet has changed
  ~ resource "azapi_resource" "vnet" {
      ~ body                      = {
          ~ properties       = {
              ~ dhcpOptions          = null -> {
                  + dnsServers = []
                }
                # (7 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
        name                      = "vnet-crv-githublab-demo-dev"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
          ~ properties = {
              ~ subnets           = [
                  - {
                      - properties = {
                          - ipConfigurations  = [
                              - {},
                            ]
                          - provisioningState = "Succeeded"
                        }
                    },
                    {
                        properties = {
                            ipConfigurations  = [
                                {},
                                {},
                            ]
                            privateEndpoints  = [
                                {},
                                {},
                            ]
                            provisioningState = "Succeeded"
                            purpose           = "PrivateEndpoints"
                        }
                    },
                    {
                        properties = {
                            provisioningState = "Succeeded"
                        }
                    },
                  + {
                      + properties = {
                          + ipConfigurations  = [
                              + {},
                            ]
                          + provisioningState = "Succeeded"
                        }
                    },
                ]
                # (3 unchanged attributes hidden)
            }
            tags       = {
                env  = "demo"
                type = "avm"
            }
            # (1 unchanged attribute hidden)
        }
        tags                      = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = null -> "10.0.1.0/26"
              ~ networkSecurityGroup              = null -> {
                  + id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/vnet-crv-githublab-demo-dev-AzureBastionSubnet-nsg-canadacentral"
                }
              ~ serviceEndpoints                  = null -> []
                # (9 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
        name                      = "AzureBastionSubnet"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
          ~ properties = {
              - addressPrefixes   = [
                  - "10.0.1.0/26",
                ]
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = null -> "10.0.1.64/28"
              ~ serviceEndpoints                  = null -> []
                # (10 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
        name                      = "private_endpoints"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
          ~ properties = {
              - addressPrefixes   = [
                  - "10.0.1.64/28",
                ]
                # (4 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = null -> "10.0.0.0/24"
              ~ networkSecurityGroup              = null -> {
                  + id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/vnet-crv-githublab-demo-dev-virtual_machines-nsg-canadacentral"
                }
              ~ serviceEndpoints                  = null -> []
                # (9 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
        name                      = "virtual_machines"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
          ~ properties = {
              - addressPrefixes   = [
                  - "10.0.0.0/24",
                ]
                # (2 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.key_vault.azurerm_key_vault.this will be updated in-place
  ~ resource "azurerm_key_vault" "this" {
        id                              = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/keyvcrv-githublabdemodev"
        name                            = "keyvcrv-githublabdemodev"
        tags                            = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ ip_rules                   = [
              - "20.172.29.0/24",
              + "172.183.79.0/24",
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # module.network_security_group.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "this" {
        id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev|sendToLogAnalytics"
      + log_analytics_destination_type = "Dedicated"
        name                           = "sendToLogAnalytics"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storage_account.azurerm_monitor_diagnostic_setting.blob["sendToLogAnalytics"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "blob" {
        id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev/blobServices/default/|sendToLogAnalytics"
        name                           = "sendToLogAnalytics"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.storage_account.azurerm_monitor_diagnostic_setting.storage_account["sendToLogAnalytics"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storage_account" {
        id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev|sendToLogAnalytics"
        name                           = "sendToLogAnalytics"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.virtual_machine.data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.virtual_machine.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/virtual_machine"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.virtual_machine.modtm_telemetry.telemetry[0] will be updated in-place
  ~ resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
        id               = "4c025758-d4ad-42a0-8505-207388776fcf"
      + nonce            = (known after apply)
      ~ tags             = {
          ~ "module_source"   = "registry.terraform.io/Azure/avm-res-compute-virtualmachine/azurerm" -> (known after apply)
          ~ "module_version"  = "0.18.0" -> (known after apply)
            "random_id"       = "506557a6-22fd-73b5-dee4-78445b797de2"
          ~ "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400" -> (known after apply)
          ~ "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a" -> (known after apply)
        }
    }

  # module.virtual_network.azapi_resource.vnet will be updated in-place
  ~ resource "azapi_resource" "vnet" {
      ~ body                      = {
          ~ properties       = {
              ~ dhcpOptions          = {
                  - dnsServers = []
                } -> null
                # (7 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
        name                      = "vnet-crv-githublab-demo-dev"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
          - properties = {
              - addressSpace      = {
                  - addressPrefixes = [
                      - "10.0.0.0/22",
                    ]
                }
              - provisioningState = "Succeeded"
              - resourceGuid      = "cc18f13f-2dbd-44e4-88f3-340297b73d90"
              - subnets           = [
                  - {
                      - properties = {
                          - ipConfigurations  = [
                              - {},
                              - {},
                            ]
                          - privateEndpoints  = [
                              - {},
                              - {},
                            ]
                          - provisioningState = "Succeeded"
                          - purpose           = "PrivateEndpoints"
                        }
                    },
                  - {
                      - properties = {
                          - provisioningState = "Succeeded"
                        }
                    },
                  - {
                      - properties = {
                          - ipConfigurations  = [
                              - {},
                            ]
                          - provisioningState = "Succeeded"
                        }
                    },
                ]
            }
          - tags       = {
              - env  = "demo"
              - type = "avm"
            }
          - type       = "Microsoft.Network/virtualNetworks"
        } -> (known after apply)
        tags                      = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet will be updated in-place
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = "10.0.1.0/26" -> null
              ~ networkSecurityGroup              = {
                  - id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/vnet-crv-githublab-demo-dev-AzureBastionSubnet-nsg-canadacentral"
                } -> null
              ~ serviceEndpoints                  = [] -> null
                # (9 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
        name                      = "AzureBastionSubnet"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
          - properties = {
              - provisioningState = "Succeeded"
            }
          - type       = "Microsoft.Network/virtualNetworks/subnets"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet will be updated in-place
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = "10.0.1.64/28" -> null
              ~ serviceEndpoints                  = [] -> null
                # (10 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
        name                      = "private_endpoints"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
          - properties = {
              - ipConfigurations  = [
                  - {},
                  - {},
                ]
              - privateEndpoints  = [
                  - {},
                  - {},
                ]
              - provisioningState = "Succeeded"
              - purpose           = "PrivateEndpoints"
            }
          - type       = "Microsoft.Network/virtualNetworks/subnets"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet will be updated in-place
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = "10.0.0.0/24" -> null
              ~ networkSecurityGroup              = {
                  - id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/vnet-crv-githublab-demo-dev-virtual_machines-nsg-canadacentral"
                } -> null
              ~ serviceEndpoints                  = [] -> null
                # (9 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
        name                      = "virtual_machines"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
          - properties = {
              - ipConfigurations  = [
                  - {},
                ]
              - provisioningState = "Succeeded"
            }
          - type       = "Microsoft.Network/virtualNetworks/subnets"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 9 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.virtual_machine.azurerm_linux_virtual_machine.this[0],
  on .terraform/modules/virtual_machine/main.linux_vm.tf line 41, in resource "azurerm_linux_virtual_machine" "this":
  41:   vm_agent_platform_updates_enabled                      = var.vm_agent_platform_updates_enabled

this property has been deprecated due to a breaking change introduced by the
Service team, which redefined it as a read-only field within the API

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @ch-rob, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*